---
kind: property
id: P:Autodesk.Revit.DB.OrdinateDimensionSetting.TextPosition
source: html/6defa5a8-9fc2-9fb0-b1fa-b527683afe71.htm
---
# Autodesk.Revit.DB.OrdinateDimensionSetting.TextPosition Property

Specifies the dimension text position.

## Syntax (C#)
```csharp
public OrdinateTextPosition TextPosition { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration